app/controllers/musts_controller.rb

SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."must_id" = ?  [["must_id", 1]]
SELECT "musts".* FROM "musts"
---
  def index
    @musts = Must.all.sort_by{|m| m.average_rating}.reverse

INSERT INTO "musts" ("name", "manufacturer", "volume", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Apotekarnes"], ["manufacturer", "Falcon"], ["volume", 33], ["price", 13.0], ["created_at", "2021-11-30 09:53:37.168361"], ["updated_at", "2021-11-30 09:53:37.168361"]]
---
  def create
    @must = Must.new(must_params)

    respond_to do |format|
      if @must.save

UPDATE "musts" SET "manufacturer" = ?, "updated_at" = ? WHERE "musts"."id" = ?  [["manufacturer", "Calsberg"], ["updated_at", "2021-12-20 13:13:59.282444"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @must.update(must_params)

DELETE FROM "musts" WHERE "musts"."id" = ?  [["id", 1]]
---
  def destroy
    @must.destroy

SELECT "musts".* FROM "musts" WHERE "musts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_must
      @must = Must.find(params[:id])