app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("must_id", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["must_id", 1], ["rating", 3], ["comment", ""], ["created_at", "2021-12-02 10:09:29.523801"], ["updated_at", "2021-12-02 10:09:29.523801"]]
---
    def create
        rating = Rating.new(ratings_params)
        rating.must = @must

        if rating.save

DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 6]]
---
    def destroy
        Rating.destroy(params[:id])

SELECT "musts".* FROM "musts" WHERE "musts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_must
        @must = Must.find(params[:must_id])