app/models/must.rb

    def average_rating
        ratings.average(:rating).round(2)
---
SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."must_id" = ?  [["must_id", 1]]